; domain
(define (domain delivery)
    (:requirements :typing :equality :negative-preconditions :constraints)
    (:types
        cell - object
        locatable - object
        package - locatable
        truck - locatable
    )

    (:predicates
        (at ?x1 - locatable ?x2 - cell)
        (carrying ?x1 - truck ?x2 - package)
        (empty ?x1 - truck)
        (adjacent ?x1 - cell ?x2 - cell)
    )

    (:action pick-package
     :parameters (?t - truck ?p - package ?x - cell)
     :precondition (and (at ?p ?x) (at ?t ?x) (empty ?t))
     :effect (and
        (not (at ?p ?x))
        (not (empty ?t))
        (carrying ?t ?p))
    )

    (:action drop-package
     :parameters (?t - truck ?p - package ?x - cell)
     :precondition (and (at ?t ?x) (carrying ?t ?p))
     :effect (and
        (empty ?t)
        (not (carrying ?t ?p))
        (at ?p ?x))
    )

    (:action move
     :parameters (?t - truck ?from - cell ?to - cell)
     :precondition (and (adjacent ?from ?to) (at ?t ?from) (not (= ?from ?to)))
     :effect (and
        (not (at ?t ?from))
        (at ?t ?to))
    )
)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Instance file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem delivery-4x4-1-1426812124)
    (:domain delivery)

    (:objects
        c_0_0 c_0_1 c_0_2 c_0_3 c_1_0 c_1_1 c_1_2 c_1_3 c_2_0 c_2_1 c_2_2 c_2_3 c_3_0 c_3_1 c_3_2 c_3_3 - cell
        p1 - package
        t1 - truck
    )

    (:init
        (adjacent c_2_2 c_2_1)
        (adjacent c_2_0 c_2_1)
        (adjacent c_2_1 c_1_1)
        (adjacent c_2_3 c_1_3)
        (adjacent c_2_3 c_3_3)
        (adjacent c_2_3 c_2_2)
        (adjacent c_2_1 c_2_0)
        (adjacent c_2_1 c_3_1)
        (adjacent c_1_3 c_1_2)
        (adjacent c_3_1 c_3_2)
        (adjacent c_3_1 c_3_0)
        (adjacent c_1_0 c_0_0)
        (adjacent c_0_2 c_0_1)
        (adjacent c_0_1 c_0_0)
        (adjacent c_3_0 c_3_1)
        (adjacent c_3_1 c_2_1)
        (adjacent c_2_1 c_2_2)
        (adjacent c_3_0 c_2_0)
        (adjacent c_1_2 c_0_2)
        (adjacent c_0_2 c_1_2)
        (adjacent c_2_0 c_1_0)
        (adjacent c_1_3 c_0_3)
        (adjacent c_2_2 c_1_2)
        (adjacent c_1_2 c_1_1)
        (adjacent c_3_2 c_3_1)
        (adjacent c_0_3 c_0_2)
        (adjacent c_1_1 c_2_1)
        (adjacent c_0_2 c_0_3)
        (adjacent c_1_2 c_2_2)
        (adjacent c_1_3 c_2_3)
        (adjacent c_3_2 c_2_2)
        (adjacent c_3_2 c_3_3)
        (adjacent c_1_2 c_1_3)
        (adjacent c_1_0 c_1_1)
        (adjacent c_0_0 c_0_1)
        (adjacent c_0_1 c_0_2)
        (adjacent c_1_0 c_2_0)
        (adjacent c_1_1 c_0_1)
        (adjacent c_0_3 c_1_3)
        (adjacent c_0_1 c_1_1)
        (adjacent c_1_1 c_1_0)
        (adjacent c_0_0 c_1_0)
        (adjacent c_3_3 c_3_2)
        (adjacent c_1_1 c_1_2)
        (adjacent c_3_3 c_2_3)
        (adjacent c_2_2 c_3_2)
        (adjacent c_2_0 c_3_0)
        (adjacent c_2_2 c_2_3)
        (at t1 c_1_3)
        (at p1 c_0_3)
        (empty t1)
    )

    (:goal
        (at p1 c_0_1)
    )

    
    
    

  (:constraints
    (always (and (not (and (last t1 c_0_2) (at t1 c_0_3))) (not (and (last t1 c_0_3) (at t1 c_0_2)))))
  )
)

; plan
1. (move t1 c_1_3 c_0_3)
   deleted: (at t1 c_1_3)
   added: (at t1 c_0_3)
   goals met: 0 of 1
2. (pick-package t1 p1 c_0_3)
   deleted: (at p1 c_0_3) (empty t1)
   added: (carrying t1 p1)
   goals met: 0 of 1
3. (move t1 c_0_3 c_1_3)
   deleted: (at t1 c_0_3)
   added: (at t1 c_1_3)
   goals met: 0 of 1
4. (move t1 c_1_3 c_1_2)
   deleted: (at t1 c_1_3)
   added: (at t1 c_1_2)
   goals met: 0 of 1
5. (move t1 c_1_2 c_1_1)
   deleted: (at t1 c_1_2)
   added: (at t1 c_1_1)
   goals met: 0 of 1
6. (move t1 c_1_1 c_0_1)
   deleted: (at t1 c_1_1)
   added: (at t1 c_0_1)
   goals met: 0 of 1
7. (drop-package t1 p1 c_0_1)
   deleted: (carrying t1 p1)
   added: (empty t1) (at p1 c_0_1)
   goals met: 1 of 1
